Sys.setlocale(,"UK_ua")

# Формати даних в R

# Вектори

c(1,2,3,4)

a <- c(1,2,3,4)

d = c(1,2,3,4)

b <- c(1:4)


Завдання:
  
  * виведіть третій елемент вектора a

# Таблиця даних

data.frame(A_column_name=a,B_column_name=b)
f <- data.frame(A_column_name=a,b)
f$A_column_name
f$b


Завдання:
  
  * виведіть третій елемент другої колонки таблиці f

# Список

cats <- list(list(Кличка="Тимко",
                        Вага=6,
                        Зріст=7,
                        Довжина=30,
                        `Частини тіла`=list(
                          Лапи=list(
                            Лапа_1=list(Тип="Передня",Зріст=7,
                                           Довжина=30),
                            Лапа_2=list(Тип="Передня",Зріст=7,
                                           Довжина=30),
                            Лапа_3=list(Тип="Задня",Зріст=7,
                                           Довжина=30),
                            Лапа_4=list(Тип="Задня",Зріст=7,
                                           Довжина=30)
                          ),
                          Вуха=data.frame(
                            Тип=c("Праве","Ліве"),
                            Колір=c("Білий","Рудий"),
                            Довжина=c(5,6),stringsAsFactors = F
                          )
                        )),
             list(Кличка="Фродо",
                        Вага=5,
                        Зріст=8,
                        Довжина=25,
                        `Частини тіла`=list(
                          Лапи=list(
                            Лапа_1=list(Тип="Передня",Зріст=7,
                                           Довжина=6),
                            Лапа_2=list(Тип="Передня",Зріст=7,
                                           Довжина=5),
                            Лапа_4=list(Тип="Задня",
                                           Зріст=7,
                                           Довжина=6)
                          ),
                          Вуха=data.frame(
                            Тип=c("Праве","Ліве"),
                            Колір=c("Чорний","Чорний"),
                            Довжина=c(4,4),stringsAsFactors = F
                          )
                        )))


Колір лівого вуха першого котика можна вивести такими способами:

cats[[1]]$`Частини тіла`$Вуха[2,"Колір"]
cats[[1]]$`Частини тіла`$Вуха[2,2]
cats[[1]]$`Частини тіла`$Вуха$Колір[2]
cats[[1]][[5]][[2]][[2]][2]
cats[[1]][[5]]$Вуха[2,"Колір"]
cats[[1]][[5]]$Вуха[2,2]
cats[[1]][[5]]$Вуха$Колір[2]


Завдання:
  - вивести довжину третьої лапи котика з більшою вагою

